v7/_special/dynamicMesh_MRF/simple/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          PCG;
        tolerance       1e-06;
        relTol          0.01;
        preconditioner  DIC;
    }

    "(U|k|epsilon|omega|R|nuTilda|nut)"
    {
        solver          PBiCGStab;
        tolerance       1e-08;
        relTol          0.01;
        preconditioner  DILU;
    }
}

SIMPLE
{
    nNonOrthogonalCorrectors 1;
    consistent      yes;

    residualControl
    {
        p               1e-15;
        U               1e-15;
    }
}


/* //SIMPLE
relaxationFactors
{
    fields
    {
        p               0.3; //0.3
    }
    equations
    {
        ".*"            0.7; //0.7
    }
}
*/

//SIMPLEC
relaxationFactors
{
    equations
    {
        ".*"            0.9;
    }
}


// ************************************************************************* //
